# Основы pandas

In [1]:
import pandas as pd

Пример забора данных с сайтов

In [2]:
df = pd.read_clipboard(sep='\t')
df

         date  value
0  25.06.2020    123
1  01.07.2020    321

In [8]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют с 25.06.2020 с 26.06.2020
0  Доллар США     68,8376₽     69,4660₽
1        Евро     77,7590₽     78,0589₽

In [9]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [11]:
df[0]

       Дата  Закрытие  Открытие  Максимум  Минимум
0  24.06.20    695135    687602    696595   686725
1  23.06.20    687637    691104    695545   685470
2  22.06.20    691152    697245    697255   689695
3  21.06.20    695560    696390    696390   694685
4  20.06.20    694650    694650    694650   694650
5  19.06.20    694650    699121    699745   691838
6  18.06.20    698940    696005    700235   691575
7  17.06.20    696582    696288    698900   693690
8  16.06.20    696395    697498    699330   691855
9  15.06.20    697665    699510    705538   695485

Импорт данных из файла

In [14]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [19]:
data.tail(3)

          country  year  quantity  category
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [20]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [21]:
# количество строк в датафрейме

len(data)

1189482

In [22]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [ ]:
a = b + 1

In [23]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [ ]:
data = pd.read_csv('transactions.csv') 
data.info()

In [25]:
t_data.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [24]:
t_data = pd.read_csv('transactions.csv') 
t_data.shape

(60, 8)

In [26]:
t_data.to_excel('t_data.xlsx', index=False)

### Основные сведения о датафрейме

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
country          1189482 non-null object
year             1189482 non-null int64
quantity         1189482 non-null float64
category         1189482 non-null int64
year_plus_one    1189482 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [ ]:
1.189482e+06

In [30]:
1.189482 * 10**6

1189482.0

In [29]:
# немного статистики

data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

### Отдельный столбец (тип Series)

In [37]:
data.iloc[:, -1]

0          1997
1          1996
2          2015
3          2014
4          2013
           ...
1189477    2013
1189478    2012
1189479    2011
1189480    2010
1189481    2009
Name: year_plus_one, Length: 1189482, dtype: int64

In [31]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [33]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [32]:
type(data['year'])

pandas.core.series.Series

In [ ]:
data.head()

In [40]:
# уникальные значения в столбце

data['category'].nunique()

71

In [39]:
len(data['category'].unique())

71

In [41]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [42]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [43]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [ ]:
var['Product'].value_counts()

In [52]:
t_data['Product'].value_counts()

_5    11
_2     8
_8     8
_4     7
_3     7
A5     5
A1     5
A4     5
_6     2
A2     2
Name: Product, dtype: int64

# Фильтры

In [53]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [54]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [57]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [58]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [59]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [61]:
f'quantity > {average_level}'

'quantity > 184264.77005012965'

In [60]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [ ]:
if data.quantity > average_level:
    print(True)
else:
    print(False)

In [62]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [63]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [64]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [65]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [66]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [67]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [68]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [69]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [71]:
# сортировка по нескольким столбцам

data.sort_values(by=['country', 'year', 'quantity'], ascending=[False, True, False]).head(50)

          country  year      quantity  category
492605   Zimbabwe  1990  7.355000e+06        31
491540   Zimbabwe  1990  5.820000e+06        31
492291   Zimbabwe  1990  1.535000e+06        31
122097   Zimbabwe  1990  9.650000e+05        12
122399   Zimbabwe  1990  9.650000e+05        12
492003   Zimbabwe  1990  7.340000e+05        31
957330   Zimbabwe  1990  7.528300e+04        55
959523   Zimbabwe  1990  7.528300e+04        55
962492   Zimbabwe  1990  7.528300e+04        55
964131   Zimbabwe  1990  7.528300e+04        55
966065   Zimbabwe  1990  7.528300e+04        55
967866   Zimbabwe  1990  7.528300e+04        55
257602   Zimbabwe  1990  1.850000e+04        23
369205   Zimbabwe  1990  1.343043e+04        25
374414   Zimbabwe  1990  1.343043e+04        25
357840   Zimbabwe  1990  1.330203e+04        25
362576   Zimbabwe  1990  1.330203e+04        25
346480   Zimbabwe  1990  1.289513e+04        25
338940   Zimbabwe  1990  1.185572e+04        25
1102802  Zimbabwe  1990  1.002400e+04        67
1108325  Zimbabwe  1990  9.559000e+03        67
1142690  Zimbabwe  1990  9.401000e+03        67
1121693  Zimbabwe  1990  9.150000e+03        67
1097270  Zimbabwe  1990  7.516000e+03        67
1037594  Zimbabwe  1990  6.036000e+03        65
1155098  Zimbabwe  1990  5.878000e+03        67
524664   Zimbabwe  1990  5.514000e+03        31
519981   Zimbabwe  1990  5.504000e+03        31
1057845  Zimbabwe  1990  4.150000e+03        67
1071219  Zimbabwe  1990  4.150000e+03        67
567114   Zimbabwe  1990  3.523000e+03        33
1165497  Zimbabwe  1990  3.523000e+03        67
526594   Zimbabwe  1990  3.493000e+03        31
1066511  Zimbabwe  1990  3.323000e+03        67
153766   Zimbabwe  1990  3.000000e+03        16
154740   Zimbabwe  1990  3.000000e+03        16
157227   Zimbabwe  1990  3.000000e+03        16
158097   Zimbabwe  1990  3.000000e+03        16
160608   Zimbabwe  1990  3.000000e+03        16
161589   Zimbabwe  1990  3.000000e+03        16
530923   Zimbabwe  1990  2.669000e+03        31
251274   Zimbabwe  1990  2.038000e+03        21
245753   Zimbabwe  1990  1.928000e+03        21
29875    Zimbabwe  1990  1.606000e+03         5
31650    Zimbabwe  1990  1.606000e+03         5
33530    Zimbabwe  1990  1.606000e+03         5
35242    Zimbabwe  1990  1.606000e+03         5
37233    Zimbabwe  1990  1.606000e+03         5
39148    Zimbabwe  1990  1.606000e+03         5
1050501  Zimbabwe  1990  1.528000e+03        67

### Параметр inplace

In [79]:
data.head()

            country  year  quantity  category
585886  Afghanistan  2009    93.000        35
126104  Afghanistan  2007   102.639        14
126105  Afghanistan  2006    99.572        14
126106  Afghanistan  2005    96.598        14
126107  Afghanistan  2004    93.211        14

In [78]:
if ...:
    data = data.sort_values('country', ascending=True)
else:

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?